## Staging: newrelic
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
```terraform
Plan: 0 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                     NAME                      |
|--------|-----------------------------------------------|
| update | `newrelic_workflow.terraform_notify_workflow` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # newrelic_workflow.terraform_notify_workflow will be updated in-place
  ~ resource "newrelic_workflow" "terraform_notify_workflow" {
        id                    = "29b5ae0e-6918-4d87-84c6-71ce34368fad"
        name                  = "Notify Workflow - staging"
        # (7 unchanged attributes hidden)

      - destination {
          - channel_id            = "3a5ec568-369c-481c-bd49-598f5d394008" -> null
          - name                  = "Terraform Notify Slack Channel - staging" -> null
          - notification_triggers = [
              - "ACKNOWLEDGED",
              - "ACTIVATED",
              - "CLOSED",
            ] -> null
          - type                  = "SLACK_LEGACY" -> null
        }
      + destination {
          + channel_id            = "3a5ec568-369c-481c-bd49-598f5d394008"
          + name                  = (known after apply)
          + notification_triggers = (known after apply)
          + type                  = (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

